IDENTIFICATION DIVISION.
PROGRAM-ID. CADASTRO-DE-FORNECEDORES.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT ARQ-FORNECEDORES ASSIGN TO "FORNECEDOR.DAT"
    ORGANIZATION IS INDEXED
    ACCESS MODE IS DYNAMIC
    RECORD KEY IS F-CNPJ
    FILE STATUS IS FS-ARQ.
DATA DIVISION.
FILE SECTION.
FD ARQ-FORNECEDORES.
01 FORNECEDOR-REG.
    05 F-CNPJ           PIC 9(14).
    05 F-RAZAO-SOCIAL   PIC X(40).
    05 F-ENDERECO       PIC X(50).
    05 F-TELEFONE       PIC 9(11).
    05 F-EMAIL          PIC X(30).
    05 F-STATUS PIC 9.
        88 F-ATIVO VALUE 1.
        88 F-INATIVO VALUE 0.

WORKING-STORAGE SECTION.
01 FS-ARQ PIC XX.
01 WS-OPCAO PIC 9.
01 WS-MENSAGEM PIC X(30) VALUE SPACES.
01 WS-CONFIRMA PIC X.
01 WS-CNPJ PIC 9(14).
01 WS-CONSULTA-STATUS PIC X.
    88 WS-CONSULTA-SUCESSO VALUE "S".
    88 WS-CONSULTA-ERRO VALUE "N".

SCREEN SECTION.
01 TELA-BRANCA.
    05 BLANK SCREEN.

01 TELA-MENU-FORNECEDOR.
    05 BLANK SCREEN.
    05 LINE 6  COLUMN 28 VALUE "1- CADASTRAR FORNECEDOR.".
    05 LINE 8  COLUMN 28 VALUE "2- ALTERAR FORNECEDOR.".
    05 LINE 10 COLUMN 28 VALUE "3- EXCLUIR FORNECEDOR.".
    05 LINE 13 COLUMN 28 VALUE "ESCOLHA UMA OPCAO: ".
    05 LINE 13 COLUMN 50 PIC 9 TO WS-OPCAO.

01 TELA-CADASTRAR-FORNECEDOR.
    05 BLANK SCREEN.
    05 LINE 3   COLUMN 30 VALUE "CADASTRAR DE FORNECEDOR.".
    05 LINE 6   COLUMN 28 VALUE "CNPJ:".
    05 LINE 6   COLUMN 43 PIC 9(14) TO F-CNPJ.
    05 LINE 8   COLUMN 28 VALUE "RAZAO SOCIAL:".
    05 LINE 8   COLUMN 43 PIC X(40) TO F-RAZAO-SOCIAL.
    05 LINE 10  COLUMN 28 VALUE "ENDERECO:".
    05 LINE 10  COLUMN 43 PIC X(50) TO F-ENDERECO.
    05 LINE 12  COLUMN 28 VALUE "TELEFONE:".
    05 LINE 12  COLUMN 43 PIC 9(11) TO F-TELEFONE.
    05 LINE 14  COLUMN 28 VALUE "EMAIL:".
    05 LINE 14  COLUMN 43 PIC X(30) TO F-EMAIL.

01 TELA-CONSULTAR-FORNECEDOR.
    02 BLANK SCREEN.
    02 LINE 6   COLUMN 28 VALUE "CNPJ:".
    02 LINE 6   COLUMN 43 PIC 9(14) TO WS-CNPJ.

01 TELA-ALTERAR-FORNECEDOR.
    05 BLANK SCREEN.
    05 LINE 3   COLUMN 30 VALUE "ALTERAR FORNECEDOR.".
    05 LINE 6   COLUMN 28 VALUE "CNPJ:".
    05 LINE 6   COLUMN 43 PIC 9(14) FROM  F-CNPJ.
    05 LINE 8   COLUMN 28 VALUE "RAZAO SOCIAL:".
    05 LINE 8   COLUMN 43 PIC X(40) USING F-RAZAO-SOCIAL.
    05 LINE 10  COLUMN 28 VALUE "ENDERECO:".
    05 LINE 10  COLUMN 43 PIC X(50) USING F-ENDERECO.
    05 LINE 12  COLUMN 28 VALUE "TELEFONE:".
    05 LINE 12  COLUMN 43 PIC 9(11) USING F-TELEFONE.
    05 LINE 14  COLUMN 28 VALUE "EMAIL:".
    05 LINE 14  COLUMN 43 PIC X(30) USING F-EMAIL.


01 TELA-PROSSEGUIR.
    05 BLANK SCREEN.
    05 LINE 6 COLUMN 28 PIC X(30) FROM WS-MENSAGEM.
    05 LINE 8 COLUMN 28 VALUE "APERTE ENTER PARA CONTINUAR".
    05 LINE 8 COLUMN PLUS 1 PIC X TO WS-CONFIRMA.

01 TELA-CONFIRMA-EXCLUSAO.
    05 BLANK SCREEN.
    05 LINE 6   COLUMN 28 VALUE "CNPJ:".
    05 LINE 6   COLUMN 43 PIC 9(14) FROM F-CNPJ.
    05 LINE 8   COLUMN 28 VALUE "RAZAO SOCIAL:".
    05 LINE 8   COLUMN 43 PIC X(40) FROM F-RAZAO-SOCIAL.
    05 LINE 10  COLUMN 28 VALUE "ENDERECO:".
    05 LINE 10  COLUMN 43 PIC X(50) FROM F-ENDERECO.
    05 LINE 12  COLUMN 28 VALUE "TELEFONE:".
    05 LINE 12  COLUMN 43 PIC 9(11) FROM F-TELEFONE.
    05 LINE 14  COLUMN 28 VALUE "EMAIL:".
    05 LINE 14  COLUMN 43 PIC X(30) FROM F-EMAIL.
    05 LINE 18  COLUMN 28 VALUE "DESEJA REALMENTE EXCLUIR ESTE REGISTRO?(S/N)".
    05 LINE 18  COLUMN PLUS 2 PIC X TO WS-CONFIRMA.

01 TELA-REGISTRO-INATIVO.
    02 BLANK SCREEN.
    02 LINE 6 COLUMN 28 VALUE "REGISTRO CNPJ".
    02 LINE 6 COLUMN PLUS 2 PIC 9(14) FROM F-CNPJ.
    02 LINE 6 COLUMN PLUS 2 VALUE "ESTA INATIVO. DESEJA REATIVA-LO?(S/N)".
    02 LINE 6 COLUMN PLUS 2 PIC X TO WS-CONFIRMA.


PROCEDURE DIVISION.
MAIN-PROCEDURE.
    OPEN I-O ARQ-FORNECEDORES
        IF FS-ARQ = "35"
            OPEN OUTPUT ARQ-FORNECEDORES
            CLOSE ARQ-FORNECEDORES
            OPEN I-O ARQ-FORNECEDORES
        END-IF
        IF FS-ARQ NOT = "00"
            DISPLAY TELA-BRANCA
            DISPLAY "ERRO AO ABRIR ARQUIVO: " FS-ARQ
            STOP RUN
        END-IF.

    DISPLAY TELA-MENU-FORNECEDOR.
    ACCEPT TELA-MENU-FORNECEDOR.

        EVALUATE WS-OPCAO
            WHEN 1
                PERFORM CADASTRAR-FORNECEDOR
            WHEN 2
                PERFORM ALTERAR-FORNECEDOR
            WHEN 3
                PERFORM EXCLUIR-FORNECEDOR
            WHEN OTHER
            DISPLAY "OPCAO INVALIDA. TENTE NOVAMENTE."
        END-EVALUATE.
        CLOSE ARQ-FORNECEDORES.
        EXIT PROGRAM.

TRATAR-ESCOLHA-SN.
    IF NOT WS-CONFIRMA = "S" AND NOT WS-CONFIRMA = "N"
        MOVE "OPCAO INVALIDA" TO WS-MENSAGEM
        DISPLAY TELA-PROSSEGUIR
        ACCEPT  TELA-PROSSEGUIR
        STOP RUN
    END-IF.

REATIVAR-REGISTRO.
    DISPLAY TELA-REGISTRO-INATIVO.
    ACCEPT TELA-REGISTRO-INATIVO.
    PERFORM TRATAR-ESCOLHA-SN.
    IF WS-CONFIRMA = "S"
        MOVE 1 TO F-STATUS.


CONSULTAR-FORNECEDOR.
    DISPLAY TELA-CONSULTAR-FORNECEDOR.
    ACCEPT TELA-CONSULTAR-FORNECEDOR.

    MOVE WS-CNPJ TO F-CNPJ.

    READ ARQ-FORNECEDORES KEY IS F-CNPJ
        INVALID KEY
            MOVE "N" TO WS-CONSULTA-STATUS
            MOVE "ERRO CNPJ NAO ENCONTRADO." TO WS-MENSAGEM
            DISPLAY TELA-PROSSEGUIR
            ACCEPT TELA-PROSSEGUIR
        NOT INVALID KEY
            MOVE "S" TO WS-CONSULTA-STATUS
    END-READ.

CADASTRAR-FORNECEDOR.
    DISPLAY TELA-CADASTRAR-FORNECEDOR.
    ACCEPT TELA-CADASTRAR-FORNECEDOR.
    MOVE 1 TO F-STATUS.

    DISPLAY TELA-BRANCA.
    WRITE FORNECEDOR-REG
        INVALID KEY
            MOVE "CNPJ JA EXISTE." TO WS-MENSAGEM
            DISPLAY TELA-PROSSEGUIR
            ACCEPT TELA-PROSSEGUIR
        NOT INVALID KEY
            MOVE "REGISTRO INSERIDO COM SUCESSO." TO WS-MENSAGEM
            DISPLAY TELA-PROSSEGUIR
            ACCEPT TELA-PROSSEGUIR
    END-WRITE.

ALTERAR-FORNECEDOR.
    PERFORM CONSULTAR-FORNECEDOR.

    IF WS-CONSULTA-SUCESSO
        IF F-INATIVO
            PERFORM REATIVAR-REGISTRO
            IF F-INATIVO
                EXIT
            END-IF
        END-IF
        DISPLAY TELA-ALTERAR-FORNECEDOR
        ACCEPT TELA-ALTERAR-FORNECEDOR
        REWRITE FORNECEDOR-REG
        MOVE "REGISTRO ALTERADO COM SUCESSO." TO WS-MENSAGEM
        DISPLAY TELA-PROSSEGUIR
        ACCEPT TELA-PROSSEGUIR
    END-IF.

EXCLUIR-FORNECEDOR.
    PERFORM CONSULTAR-FORNECEDOR.

    IF WS-CONSULTA-SUCESSO
        IF F-INATIVO
            MOVE "REGISTRO JA ESTA INATIVO" TO WS-MENSAGEM
            DISPLAY TELA-PROSSEGUIR
            ACCEPT TELA-PROSSEGUIR
            CLOSE ARQ-FORNECEDORES
            STOP RUN
        END-IF
        DISPLAY TELA-CONFIRMA-EXCLUSAO
        ACCEPT TELA-CONFIRMA-EXCLUSAO

        PERFORM TRATAR-ESCOLHA-SN
        IF WS-CONFIRMA = "S"
            MOVE 0 TO F-STATUS
            REWRITE FORNECEDOR-REG
            MOVE "EXCLUINDO REGISTRO..." TO WS-MENSAGEM
            DISPLAY TELA-PROSSEGUIR
            ACCEPT TELA-PROSSEGUIR
   END-IF.
