IDENTIFICATION DIVISION.
PROGRAM-ID. CONSULTA-DE-FORNECEDORES.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT ARQ-FORNECEDORES ASSIGN TO "FORNECEDOR.DAT"
    ORGANIZATION IS INDEXED
    ACCESS MODE IS DYNAMIC
    RECORD KEY IS F-CNPJ
    FILE STATUS IS FS-ARQ.
DATA DIVISION.
FILE SECTION.
FD ARQ-FORNECEDORES.
01 FORNECEDOR-REG.
    05 F-CNPJ           PIC 9(14).
    05 F-RAZAO-SOCIAL   PIC X(40).
    05 F-ENDERECO       PIC X(50).
    05 F-TELEFONE       PIC 9(11).
    05 F-EMAIL          PIC X(30).
    05 F-STATUS PIC 9.
        88 F-ATIVO VALUE 1.
        88 F-INATIVO VALUE 0.

WORKING-STORAGE SECTION.
01 FS-ARQ PIC XX.
01 WS-MENSAGEM PIC X(20).
01 WS-CONFIRMA PIC X.

SCREEN SECTION.
01 TELA-BRANCA.
    05 BLANK SCREEN.

01 TELA-CONSULTAR-FORNECEDOR.
    02 BLANK SCREEN.
    02 LINE 6   COLUMN 28 VALUE "CNPJ:".
    02 LINE 6   COLUMN 43 PIC 9(14) TO F-CNPJ.

01 TELA-EXIBIR-FORNECEDOR.
    05 BLANK SCREEN.
    05 LINE 6   COLUMN 28     VALUE "CNPJ:".
    05 LINE 6   COLUMN 43     PIC 9(14) FROM F-CNPJ.
    05 LINE 8   COLUMN 28     VALUE "RAZAO SOCIAL:".
    05 LINE 8   COLUMN 43     PIC X(40) FROM F-RAZAO-SOCIAL.
    05 LINE 10  COLUMN 28     VALUE "ENDERECO:".
    05 LINE 10  COLUMN 43     PIC X(50) FROM F-ENDERECO.
    05 LINE 12  COLUMN 28     VALUE "TELEFONE:".
    05 LINE 12  COLUMN 43     PIC 9(11) FROM F-TELEFONE.
    05 LINE 14  COLUMN 28     VALUE "EMAIL:".
    05 LINE 14  COLUMN 43     PIC X(30) FROM F-EMAIL.
    05 LINE 16  COLUMN 28     VALUE "APERTE ENTER PARA CONTINUAR".
    05 LINE 16  COLUMN PLUS 1 PIC X TO WS-CONFIRMA.

01 TELA-ERRO.
    02 BLANK SCREEN.
    02 LINE 6 COLUMN 28     VALUE "ERRO:".
    02 LINE 6 COLUMN PLUS 1 PIC X(20) FROM WS-MENSAGEM.
    02 LINE 8 COLUMN 28     VALUE "PRESSIONE ENTER PARA CONTINUAR.".
    02 LINE 8 COLUMN PLUS 2 PIC X TO WS-CONFIRMA.


PROCEDURE DIVISION.

MAIN-PROCEDURE.
    OPEN I-O ARQ-FORNECEDORES
    IF FS-ARQ = "35"
        OPEN OUTPUT ARQ-FORNECEDORES
        CLOSE ARQ-FORNECEDORES
        OPEN I-O ARQ-FORNECEDORES
    END-IF
    IF FS-ARQ NOT = "00"
        DISPLAY TELA-BRANCA
        DISPLAY "ERRO AO ABRIR ARQUIVO: " FS-ARQ
        STOP RUN
    END-IF.

    DISPLAY TELA-CONSULTAR-FORNECEDOR.
    ACCEPT  TELA-CONSULTAR-FORNECEDOR.

    READ ARQ-FORNECEDORES
        INVALID KEY
            MOVE "CNPJ NAO ENCONTRADO" TO WS-MENSAGEM
            DISPLAY TELA-ERRO
            ACCEPT  TELA-ERRO
            STOP RUN
        NOT INVALID KEY
            IF F-INATIVO
                MOVE "FORNECEDOR INATIVO" TO WS-MENSAGEM
                DISPLAY TELA-ERRO
                ACCEPT  TELA-ERRO
                STOP RUN
            END-IF
            IF F-ATIVO
                DISPLAY TELA-EXIBIR-FORNECEDOR
                ACCEPT  TELA-EXIBIR-FORNECEDOR
            END-IF
    END-READ.

    CLOSE ARQ-FORNECEDORES.
    EXIT PROGRAM.
