IDENTIFICATION DIVISION.
PROGRAM-ID. MENU-PRINCIPAL.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
01 FS-ARQ       PIC XX.
01 WS-OPCAO     PIC 99.
01 WS-OPCAO-REL PIC 99.
01 WS-MENSAGEM  PIC X(30) VALUE SPACES.
01 WS-CONFIRMA  PIC X.
01 WS-LOOP      PIC X VALUE "N".
    88 WS-SAIR VALUE "S".

SCREEN SECTION.
01 TELA-BRANCA.
    05 BLANK SCREEN.

01 TELA-MENU.
    05 BLANK SCREEN.
    05 LINE 6  COLUMN 28 VALUE "1- CADASTRO DE FORNECEDORES".
    05 LINE 8  COLUMN 28 VALUE "2- LANCAMENTO DE CONTAS".
    05 LINE 10 COLUMN 28 VALUE "3- PAGAMENTO DE CONTAS".
    05 LINE 12 COLUMN 28 VALUE "4- CONSULTAS".
    05 LINE 14 COLUMN 28 VALUE "5- RELATORIOS".
    05 LINE 16 COLUMN 28 VALUE "6- SAIR".
    05 LINE 20 COLUMN 28 VALUE "ESCOLHA UMA OPCAO:".
    05 LINE 20 COLUMN PLUS 2 PIC 9 TO WS-OPCAO.

01 TELA-MENU-RELATORIOS.
    05 BLANK SCREEN.
    05 LINE 6  COLUMN 28 VALUE "1- RELATORIO DE CONTAS A PAGAR".
    05 LINE 8  COLUMN 28 VALUE "2- RELATORIO DE PAGAMENTOS".
    05 LINE 16 COLUMN 28 VALUE "3- VOLTAR".
    05 LINE 20 COLUMN 28 VALUE "ESCOLHA UMA OPCAO:".
    05 LINE 20 COLUMN PLUS 2 PIC 9 TO WS-OPCAO-REL.


PROCEDURE DIVISION.
PERFORM MAIN-PROCEDURE.

ESCOLHER-RELATORIO.
    DISPLAY TELA-MENU-RELATORIOS
    ACCEPT  TELA-MENU-RELATORIOS

    EVALUATE WS-OPCAO-REL
        WHEN 1
            DISPLAY TELA-BRANCA
            CALL "RELATORIO-DE-CONTAS"
        WHEN 2
            DISPLAY TELA-BRANCA
            CALL "RELATORIO-PAGAMENTOS"
        WHEN 3
            DISPLAY TELA-BRANCA
        WHEN OTHER
            DISPLAY TELA-BRANCA
            DISPLAY "ERRO: OPCAO INVALIDA"
            STOP RUN
    END-EVALUATE.

MAIN-PROCEDURE.
    PERFORM UNTIL WS-SAIR
        MOVE 0 TO WS-OPCAO
        MOVE 0 TO WS-OPCAO-REL
        DISPLAY TELA-MENU
        ACCEPT TELA-MENU

        EVALUATE WS-OPCAO
            WHEN 1
                DISPLAY TELA-BRANCA
                CALL "CADASTRO-DE-FORNECEDORES"
            WHEN 2
                DISPLAY TELA-BRANCA
                CALL "LANCAMENTO-DE-CONTAS"
            WHEN 3
                DISPLAY TELA-BRANCA
                CALL "PAGAMENTO-DE-CONTAS"
            WHEN 4
                DISPLAY TELA-BRANCA
                CALL "CONSULTA-DE-FORNECEDORES"
            WHEN 5
                DISPLAY TELA-BRANCA
                PERFORM ESCOLHER-RELATORIO
            WHEN 6
                MOVE "S" TO WS-LOOP
            WHEN OTHER
                DISPLAY TELA-BRANCA
                DISPLAY "ERRO: OPCAO INVALIDA"
                STOP RUN
        END-EVALUATE
    END-PERFORM.
    STOP RUN.
    END PROGRAM MENU-PRINCIPAL.
